## Eksik Veri

In [2]:
import pandas as pd
import numpy as np

In [3]:
sozlukVerisi={"İstanbul" : [30,29,np.nan],"Ankara": [20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
havaDurumuDataFrame.dropna() # nan olanları düşür, drop et. Satırda nan varsa tamamen siler

   İstanbul  Ankara  Izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
havaDurumuDataFrame.dropna(axis=1) # axis=1 dediğimiz için nan olmayan sütunu aldık

   Izmir
0     40
1     39
2     38

In [8]:
yeniVeri={"İstanbul" : [30,29,np.nan],"Ankara": [20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [9]:
yeniDataFrame

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [10]:
yeniDataFrame.dropna(axis=1,thresh=2) # 1 na varsa dursun daha fazlaysa sil,thresh =2 dediğimiz için 2 ve üstü nan ları siler

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
yeniDataFrame.fillna(0) # fill.na boş olanları doldur demek

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     0.0     39      0.0
2       0.0    25.0     38      0.0

## groupby

In [12]:
maasSozlugu = {"Departmanlar": ["Yazılım","Satış","Pazarlama","Finans","İnsan Kaynakları","Hukuk"],
              "Çalışan İsmi":["Ahmet","Mehmet","Onur","Burak","Zeynep","Fatma"],
              "Maas": [100,150,300,200,5,900]}

In [13]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [14]:
maasDataFrame

       Departmanlar Çalışan İsmi  Maas
0           Yazılım        Ahmet   100
1             Satış       Mehmet   150
2         Pazarlama         Onur   300
3            Finans        Burak   200
4  İnsan Kaynakları       Zeynep     5
5             Hukuk        Fatma   900

In [15]:
yeniIndexListesi= ["1","2","3","4","5","6"]

In [16]:
maasDataFrame["Yeni Index"]=yeniIndexListesi

In [17]:
maasDataFrame

       Departmanlar Çalışan İsmi  Maas Yeni Index
0           Yazılım        Ahmet   100          1
1             Satış       Mehmet   150          2
2         Pazarlama         Onur   300          3
3            Finans        Burak   200          4
4  İnsan Kaynakları       Zeynep     5          5
5             Hukuk        Fatma   900          6

In [18]:
maasDataFrame.set_index("Yeni Index",inplace=True)

In [29]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maas
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Onur   300
3    Pazarlama        Burak   200
4        Hukuk       Zeynep     5
5        Hukuk        Fatma   900

In [30]:
maasDataFrame.reset_index()

   index Departmanlar Çalışan İsmi  Maas
0      0      Yazılım        Ahmet   100
1      1      Yazılım       Mehmet   150
2      2    Pazarlama         Onur   300
3      3    Pazarlama        Burak   200
4      4        Hukuk       Zeynep     5
5      5        Hukuk        Fatma   900

In [31]:
maasSozlugu = {"Departmanlar": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Çalışan İsmi":["Ahmet","Mehmet","Onur","Burak","Zeynep","Fatma"],
              "Maas": [100,150,300,200,5,900]}

In [32]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [33]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maas
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Onur   300
3    Pazarlama        Burak   200
4        Hukuk       Zeynep     5
5        Hukuk        Fatma   900

In [34]:
groupObjesi=maasDataFrame.groupby("Departmanlar")

In [35]:
groupObjesi.count()

              Çalışan İsmi  Maas
Departmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazılım                  2     2

In [36]:
groupObjesi.mean()

               Maas
Departmanlar
Hukuk         452.5
Pazarlama     250.0
Yazılım       125.0

In [37]:
groupObjesi.min()

             Çalışan İsmi  Maas
Departmanlar
Hukuk               Fatma     5
Pazarlama           Burak   200
Yazılım             Ahmet   100

In [38]:
groupObjesi.max()

             Çalışan İsmi  Maas
Departmanlar
Hukuk              Zeynep   900
Pazarlama            Onur   300
Yazılım            Mehmet   150

In [39]:
groupObjesi.describe() # betimlemek

              Maas
             count   mean         std    min     25%    50%     75%    max
Departmanlar
Hukuk          2.0  452.5  632.860569    5.0  228.75  452.5  676.25  900.0
Pazarlama      2.0  250.0   70.710678  200.0  225.00  250.0  275.00  300.0
Yazılım        2.0  125.0   35.355339  100.0  112.50  125.0  137.50  150.0

In [49]:
df = pd.read_excel('/Users/Onur/Desktop/Kitap1.xlsx') # excelden veri cekmek
print(df.head())

  index    İsim       Spor Kalori
0     0   Ahmet       Koşu    100
1     1  Mehmet      Yüzme    200
2     2  Zeynep       Koşu    300
3     3    Atıl  Basketbol    150
4   NaN     NaN        NaN    NaN

In [50]:
df

    index    İsim       Spor      Kalori
0       0   Ahmet       Koşu         100
1       1  Mehmet      Yüzme         200
2       2  Zeynep       Koşu         300
3       3    Atıl  Basketbol         150
4     NaN     NaN        NaN         NaN
5     NaN     NaN        NaN         NaN
6   index    İsim       Spor      Kalori
7       4   Osman       Koşu         200
8       5    Onur      Yüzme         300
9       6    Veli       Koşu         150
10      7     Ali  Basketbol  166.666667
11    NaN     NaN        NaN         NaN
12  index    İsim       Spor      Kalori
13      8    Ayla       Koşu  141.666667
14      9  Aybüke      Yüzme  116.666667
15     10   Duygu  Badminton         100
16     11     Nur      Tenis         200

In [53]:
df.head()

  index    İsim       Spor Kalori
0     0   Ahmet       Koşu    100
1     1  Mehmet      Yüzme    200
2     2  Zeynep       Koşu    300
3     3    Atıl  Basketbol    150
4   NaN     NaN        NaN    NaN

In [55]:
sozluk1={"Isim": ["Ahmet","Mehmet","Zeynep","Onur"],
        "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[100,200,300,400]}

In [57]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3]) # indexler girilmese de bu şekilde verecekti

In [58]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Onur  Basketbol     400

In [59]:
dataFrame2 = pd.DataFrame(sozluk1)

In [60]:
dataFrame2

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Onur  Basketbol     400

In [61]:
sozluk2={"Isim": ["Osman","Levent","Atlas","Fatma"],
        "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[200,50,500,700]}

In [64]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [65]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme      50
6   Atlas       Koşu     500
7   Fatma  Basketbol     700

In [66]:
sozluk3={"Isim": ["Ayse","Mahmut","Duygu","Nur"],
        "Spor": ["Koşu","Yüzme","Badminton","Tenis"],
        "Kalori":[80,900,5,345]}

In [67]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [68]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu      80
9   Mahmut      Yüzme     900
10   Duygu  Badminton       5
11     Nur      Tenis     345

In [71]:
tablo=pd.DataFrame(dataFrame1+dataFrame2+dataFrame3)

In [72]:
tablo

   Isim Spor  Kalori
0   NaN  NaN     NaN
1   NaN  NaN     NaN
2   NaN  NaN     NaN
3   NaN  NaN     NaN
4   NaN  NaN     NaN
5   NaN  NaN     NaN
6   NaN  NaN     NaN
7   NaN  NaN     NaN
8   NaN  NaN     NaN
9   NaN  NaN     NaN
10  NaN  NaN     NaN
11  NaN  NaN     NaN

## concatetion (birleştirme)

In [81]:
dfBirlesmis=pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) # axis belirtmezsek 0 alır

In [82]:
dfBirlesmis

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Onur  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme      50
6    Atlas       Koşu     500
7    Fatma  Basketbol     700
8     Ayse       Koşu      80
9   Mahmut      Yüzme     900
10   Duygu  Badminton       5
11     Nur      Tenis     345

## merge (birleştirme,kaynaştırma gibi)

In [115]:
mergeSozluk1={"Isim": ["Ahmet","Mehmet","Zeynep","Onur"],
        "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]}

In [116]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [117]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Onur  Basketbol

In [118]:
mergeSozluk2={"Isim": ["Ahmet","Mehmet","Zeynep","Onur"],
        "Kalori":[200,50,500,700]}

In [119]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [120]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     200
1  Mehmet      50
2  Zeynep     500
3    Onur     700

In [123]:
mergeDataFrame3

     Isim       Spor  Kalori
0    Ayse       Koşu      80
1  Mahmut      Yüzme     900
2   Duygu  Badminton       5
3     Nur      Tenis     345

In [124]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim") # isimler ortak ve spor ile kalori farkli olduğu için bunları birleştirdik

     Isim       Spor  Kalori
0   Ahmet       Koşu     200
1  Mehmet      Yüzme      50
2  Zeynep       Koşu     500
3    Onur  Basketbol     700

In [129]:
maasSozluk={"Isim":["Atil","Ali","Zehra","Bartu"],
           "Departman": ["Yazilim","Satis","Pazarlama","Yazilim"],
           "Maas": [200,300,400,500]}

In [130]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [131]:
maasDataFrame

    Isim  Departman  Maas
0   Atil    Yazilim   200
1    Ali      Satis   300
2  Zehra  Pazarlama   400
3  Bartu    Yazilim   500

In [132]:
maasDataFrame["Departman"] # Departmanlari getir

0      Yazilim
1        Satis
2    Pazarlama
3      Yazilim
Name: Departman, dtype: object

In [135]:
maasDataFrame["Departman"].unique() # Departmanlari tekrarsiz şekilde getirir

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [136]:
len(maasDataFrame["Departman"].unique()) # kac tane departman oldugunu bu sekilde kolayca görebiliriz

3

In [137]:
maasDataFrame["Departman"].nunique() # yukaridaki gibi kac tane oldugunu verir

3

In [141]:
maasDataFrame["Departman"].value_counts()  # her departmadan kacar kisinin bulundugunu verir

Yazilim      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [145]:
def bruttenNete (maas):
    return maas*0.66

In [146]:
maasDataFrame["Maas"].apply(bruttenNete)  # tüm maas degerlerini 0.66 ile carptik

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [147]:
maasDataFrame.isnull()  # null deger var mi ?

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [148]:
yeniBirVeri={"Karakter Sınıfı": ["South Park", "South Park", "Simpson", "Simpson"],
            "Karakter Ismi": ["Cartman", "Kenny", "Hommer","Bart"],
             "Karakter Yas": [9,10,50,20]
            }

In [149]:
karakterDf=pd.DataFrame(yeniBirVeri)

In [150]:
karakterDf

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson        Hommer            50
3         Simpson          Bart            20

In [152]:
karakterDf.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     20
                Hommer                   50
South Park      Cartman                   9
                Kenny                    10

In [157]:
yeniBirVeri={"Karakter Sınıfı": ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
            "Karakter Ismi": ["Cartman", "Kenny", "Hommer","Bart","Bart"],
             "Karakter Puan": [9,10,50,20,100]
            }

In [158]:
karakterDf=pd.DataFrame(yeniBirVeri)

In [159]:
karakterDf

  Karakter Sınıfı Karakter Ismi  Karakter Puan
0      South Park       Cartman              9
1      South Park         Kenny             10
2         Simpson        Hommer             50
3         Simpson          Bart             20
4         Simpson          Bart            100

In [160]:
karakterDf.pivot_table(values="Karakter Puan",
                       index=["Karakter Sınıfı",
                              "Karakter Ismi"])
# bart icin 2 degerin ortalamasini aldi

                               Karakter Puan
Karakter Sınıfı Karakter Ismi
Simpson         Bart                      60
                Hommer                    50
South Park      Cartman                    9
                Kenny                     10

In [161]:
karakterDf.pivot_table(values="Karakter Puan",
                       index=["Karakter Sınıfı",
                              "Karakter Ismi"],aggfunc=np.sum)
# bart icin 2 degerin toplamini aldi

                               Karakter Puan
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     120
                Hommer                    50
South Park      Cartman                    9
                Kenny                     10

In [170]:
df = pd.read_excel('/Users/Onur/Desktop/Kitap1.xlsx') # excelden veri cekmek
print(df) # eksik datalar NaN olarak döndü

    index    İsim       Spor      Kalori
0       0   Ahmet       Koşu  100.000000
1       1  Mehmet        NaN  200.000000
2       2  Zeynep       Koşu  300.000000
3       3    Atıl  Basketbol         NaN
4       4   Osman       Koşu  200.000000
5       5    Onur      Yüzme  300.000000
6       6    Veli       Koşu  150.000000
7       7     Ali  Basketbol  166.666667
8       8    Ayla       Koşu  141.666667
9       9  Aybüke      Yüzme  116.666667
10     10   Duygu  Badminton  100.000000
11     11     Nur      Tenis  200.000000

In [179]:
doludf=df.dropna() # boş olan satırları attı

In [180]:
doludf

    index    İsim       Spor      Kalori
0       0   Ahmet       Koşu  100.000000
2       2  Zeynep       Koşu  300.000000
4       4   Osman       Koşu  200.000000
5       5    Onur      Yüzme  300.000000
6       6    Veli       Koşu  150.000000
7       7     Ali  Basketbol  166.666667
8       8    Ayla       Koşu  141.666667
9       9  Aybüke      Yüzme  116.666667
10     10   Duygu  Badminton  100.000000
11     11     Nur      Tenis  200.000000

In [192]:
doludf.to_excel('/Users/Onur/Desktop/yeni.xlsx')  # excele yazdırmak

In [ ]:
## read_csv
## to_csv